Sub-IoT/Sub-IoT-Stack/stack/framework/hal/chips/ezr32lg/emlib/inc/em_acmp.h
#if defined(_ACMP_CTRL_ACCURACY_MASK)
  /** ACMP accuracy mode. Select the accuracy mode that matches the
   *  required current usage and accuracy requirement. Low accuracy
   *  consumes less current while high accuracy consumes more current. */
  ACMP_Accuracy_TypeDef        accuracy;
#endif

#if defined(_ACMP_CTRL_PWRSEL_MASK)
  /** Select the power source for the ACMP. */
  ACMP_PowerSource_TypeDef     powerSource;
#endif

#if defined(_ACMP_CTRL_WARMTIME_MASK)
  /** Warmup time. This is measured in HFPERCLK cycles and should be
   *  about 10us in wall clock time. */
  ACMP_WarmTime_TypeDef        warmTime;
#endif

#if defined(_ACMP_CTRL_HYSTSEL_MASK)
  /** Hysteresis level */
  ACMP_HysteresisLevel_TypeDef hysteresisLevel;
#else
  /** Hysteresis when ACMP output is 0 */
  ACMP_HysteresisLevel_TypeDef  hysteresisLevel_0;

  /** Hysteresis when ACMP output is 1 */
  ACMP_HysteresisLevel_TypeDef  hysteresisLevel_1;
#endif

#if defined(_ACMP_INPUTSEL_VLPSEL_MASK)
  /** VLP Input source. Select between using VADIV or VBDIV as the VLP
   *  source. */
  ACMP_VLPInput_Typedef        vlpInput;
#endif

  /** Inactive value emitted by the ACMP during warmup */
  bool                         inactiveValue;

#if defined(_ACMP_INPUTSEL_LPREF_MASK)
  /** Low power reference enabled. This setting, if enabled, reduces the
   *  power used by the VDD and bandgap references. */
  bool                         lowPowerReferenceEnabled;
#endif

#if defined(_ACMP_INPUTSEL_VDDLEVEL_MASK)
  /** Vdd reference value. VDD_SCALED = VDD * VDDLEVEL * 50mV/3.8V.
   *  Valid values are in the range 0-63. */
  uint32_t                     vddLevel;
#endif

  /** If true, ACMP is being enabled after configuration. */
  bool                         enable;
} ACMP_Init_TypeDef;

/** Default config for ACMP regular initialization. */
#if defined(_ACMP_HYSTERESIS0_HYST_MASK)
#define ACMP_INIT_DEFAULT                                                   \
{                                                                           \
  false,                      /* fullBias */                                \
  0x7,                        /* biasProg */                                \
  false,                      /* No interrupt on falling edge. */           \
  false,                      /* No interrupt on rising edge. */            \
  acmpInputRangeFull,         /* Input range from 0 to Vdd. */              \
  acmpAccuracyLow,            /* Low accuracy, less current usage. */       \
  acmpPowerSourceAvdd,        /* Use the AVDD supply. */                    \
  acmpHysteresisLevel5,       /* Use hysteresis level 5 when output is 0 */ \
  acmpHysteresisLevel5,       /* Use hysteresis level 5 when output is 1 */ \
  acmpVLPInputVADIV,          /* Use VADIV as the VLP input source. */      \
  false,                      /* Output 0 when ACMP is inactive. */         \
  true                        /* Enable after init. */                      \
}
#elif defined(_ACMP_CTRL_WARMTIME_MASK)
#define ACMP_INIT_DEFAULT                                                   \
{                                                                           \
  false,              /* fullBias */                                        \
  false,              /* halfBias */                                        \
  0x7,                /* biasProg */                                        \
  false,              /* No interrupt on falling edge. */                   \
  false,              /* No interrupt on rising edge. */                    \
  acmpWarmTime512,    /* 512 cycle warmup to be safe */                     \
  acmpHysteresisLevel5,                                                     \
  false,              /* Disabled emitting inactive value during warmup. */ \
  false,              /* low power reference */                             \
  0x3D,               /* VDD level */                                       \
  true                /* Enable after init. */                              \
}
#else
#define ACMP_INIT_DEFAULT                                                   \
{                                                                           \
  false,              /* fullBias */                                        \
  false,              /* halfBias */                                        \
  0x7,                /* biasProg */                                        \
  false,              /* No interrupt on falling edge. */                   \
  false,              /* No interrupt on rising edge. */                    \
  acmpHysteresisLevel5,                                                     \
  false,              /* Disabled emitting inactive value during warmup. */ \
  false,              /* low power reference */                             \
  0x3D,               /* VDD level */                                       \
  true                /* Enable after init. */                              \
}
#endif

#if defined(_ACMP_INPUTSEL_VASEL_MASK)
/** VA Configuration structure. This struct is used to configure the
 *  VA voltage input source and it's dividers. */
typedef struct
{
  ACMP_VAInput_TypeDef input; /**< VA voltage input source */

  /**
   * Divider for VA voltage input source when ACMP output is 0. This value is
   * used to divide the VA voltage input source by a specific value. The valid
   * range is between 0 and 63.
   *
   *  VA divided = VA input * (div0 + 1) / 64
   */
  uint32_t             div0;

  /**
   * Divider for VA voltage input source when ACMP output is 1. This value is
   * used to divide the VA voltage input source by a specific value. The valid
   * range is between 0 and 63.
   *
   *  VA divided = VA input * (div1 + 1) / 64
   */
  uint32_t             div1;
} ACMP_VAConfig_TypeDef;

#define ACMP_VACONFIG_DEFAULT                                               \
{                                                                           \
  acmpVAInputVDD, /* Use Vdd as VA voltage input source */                  \
  63,             /* No division of the VA source when ACMP output is 0 */  \
  63,             /* No division of the VA source when ACMP output is 1 */  \
}
#endif

#if defined(_ACMP_INPUTSEL_VBSEL_MASK)
/** VB Configuration structure. This struct is used to configure the
 *  VB voltage input source and it's dividers. */
typedef struct
{
  ACMP_VBInput_TypeDef input; /**< VB Voltage input source */

  /**
   * Divider for VB voltage input source when ACMP output is 0. This value is
   * used to divide the VB voltage input source by a specific value. The valid
   * range is between 0 and 63.
   *
   *  VB divided = VB input * (div0 + 1) / 64
   */
  uint32_t             div0;

  /**
   * Divider for VB voltage input source when ACMP output is 1. This value is
   * used to divide the VB voltage input source by a specific value. The valid
   * range is between 0 and 63.
   *
   *  VB divided = VB input * (div1 + 1) / 64
   */
  uint32_t             div1;
} ACMP_VBConfig_TypeDef;

#define ACMP_VBCONFIG_DEFAULT                                               \
{                                                                           \
  acmpVBInput1V25, /* Use 1.25 V as VB voltage input source */              \
  63,              /* No division of the VB source when ACMP output is 0 */ \
  63,              /* No division of the VB source when ACMP output is 1 */ \
}
#endif

